Repository: tano-systems/luci-app-tn-swupdate
Catalog: po/*/swupdate.po
Languages: ru

source: %1024.2mB
ru: %1024.2mБ

source: %1024.2mB of %1024.2mB
ru: %1024.2mБ из %1024.2mБ

source: %1024.2mB/s
ru: %1024.2mБ/с

source: %d bytes
ru: %d байт

source: %d of %d
ru: %d из %d

source: Attention
ru: Внимание

source: Average speed
ru: Средняя скорость

source: Booting the system with the new firmware failed. The system has been rolled back to the previous firmware and is now booted with the previous firmware.
ru: Загрузка системы с новой прошивкой завершилась неудачно. Был произведён возврат на предыдущую прошивку и сейчас система загружена с предыдущей прошивкой.

source: Browse...
ru: Обзор...

source: Checking this option will completely erase the user data (including the device configuration) during firmware upgrade
ru: Включение этой опции приведет к полной очистке пользовательских данных (включая конфигурацию устройства) при обновлении прошивки

source: Close
ru: Закрыть

source: Current speed
ru: Текущая скорость

source: Dry run mode
ru: «Холостой» режим

source: Erase user data
ru: Очистка пользовательских данных

source: File
ru: Файл

source: Firmware Upgrade
ru: Обновление прошивки

source: Firmware Upgrade Log
ru: Журнал обновления прошивки

source: Firmware Upgrade Progress
ru: Прогресс обновления прошивки

source: Firmware file
ru: Файл прошивки

source: Firmware version
ru: Версия прошивки

source: Grant access to firmware upgrade
ru: Предоставить доступ к обновлению прошивки

source: Here you can perform firmware upgrade on this device.
ru: Здесь вы можете выполнить обновление прошивки на этого устройства.

source: If this option is enabled, the actual flashing will not be performed on the device. If this option is checked, user data is also not erased when the option "Erase user data" is checked.
ru: Если данный режим включен, фактическая прошивка устройства не будет производиться. Также, если эта опция включена, то при выборе опции «Очистка пользовательских данных» данные не будут очищены.

source: Information
ru: Информация

source: Installation failure
ru: Сбой при установке

source: Installation in progress, please wait...
ru: Установка в процессе, пожалуйста подождите...

source: Installation timed out
ru: Таймаут завершения установки

source: Installing / Flashing
ru: Установка / прошивка

source: No
ru: Нет

source: Not enough permissions
ru: Недостаточно разрешений

source: Note that firmware upgrading can take a long time, up to 5–15 minutes (depending on the connection speed). So please be patient during this operation.
ru: Обратите внимание, что обновление прошивки может занять длительное время, вплоть до 5–15 минут (в зависимости от скорости подключения). Поэтому, пожалуйста, будьте терпеливы во время этой операции.

source: Once the firmware upgrade procedure has been started, please do NOT POWER OFF the device until the firmware upgrade is fully completed.
ru: После начала процедуры обновления прошивки НЕ ВЫКЛЮЧАЙТЕ устройство, пока обновление прошивки не будет полностью завершено.

source: Ready for upgrade
ru: Готово к обновлению прошивки

source: Rebooting, please wait...
ru: Перезагрузка устройства, пожалуйста подождите...

source: Size
ru: Размер

source: Step
ru: Шаг

source: Successfully completed
ru: Успешно завершено

source: Upgrade Configuration and Actions
ru: Конфигурация и действия обновления прошивки

source: Upgrade firmware
ru: Обновление прошивки

source: Upgrade in progress, please wait...
ru: Обновление в процессе, пожалуйста подождите...

# Button Title
source: Upgrade...
ru: Обновить...

source: Upload and upgrade firmware
ru: Загрузить и обновить прошивку

source: Uploaded
ru: Загружено

source: Uploading
ru: Загрузка

source: Uploading failure
ru: Сбой при загрузке

source: Yes
ru: Да

source: not selected
ru: не выбран
